# 课堂练习4
# 假如字典player中是游戏角色勇士的基本信息，字典monster中是怪物的信息
# 请利用程序，计算出勇士和怪物战斗一回合结束后，各自的生命值，并输出
# 提示1：角色对目标造成的伤害可以通过自身攻击属性的数值减去目标防御属性数值获得
# 提示2：被攻击角色剩余的生命值等于改角色本来的生命值减去受到的伤害值
player = {
    '生命值': 500,
    '攻击力': 200,
    '防御': 100,
}
monster = {
    '生命值': 500,
    '攻击力': 150,
    '防御': 50,
}
# 勇士剩余生命值计算
damage1 = player['攻击力'] - monster['防御']
player['生命值'] = player['生命值'] - damage1
# 怪物剩余生命值计算
damage2 = monster['攻击力'] - player['防御']
monster['生命值'] = monster['生命值'] - damage2
print('勇士剩余的生命值为：', player['生命值'])
print('怪物剩余的生命值为：', monster['生命值'])
