# 课堂练习一
# 字典weather记录了12月18日不同城市的最高温（high）和最低温（low）
# 要求： 1.请使用字典推导式构建 城市名:最高温 的字典并输出
#       示例：{'北京': '-4℃', '上海': '6℃', '沈阳': '-11℃',...}
#       2.请使用字典推导式构建 城市名:最低温 的字典并输出
#       示例：{'北京': '-12℃', '上海': '4℃', '沈阳': '-16℃', ...}

weather = {'北京': {'date': '12.18', 'high': '-4℃', 'low': '-12℃'},
           '上海': {'date': '12.18', 'high': '6℃', 'low': '4℃'},
           '沈阳': {'date': '12.18', 'high': '-11℃', 'low': '-16℃'},
           '武汉': {'date': '12.18', 'high': '1℃', 'low': '-3℃'},
           '广州': {'date': '12.18', 'high': '15℃', 'low': '9℃'}
           }
# 请在下方编写代码
high_dict = {w: t['high'] for w, t in weather.items()}
low_dict = {w: t['low'] for w, t in weather.items()}
print(high_dict)
print(low_dict)
