# 1. 定义三个集合s1，s2，s3，保存三个采购清单
s1 = {'可乐', '面包', '火腿', '香蕉'}
s2 = {'牛奶', '薯片', '火腿', '香蕉'}
s3 = {'牛奶', '面包', '火腿', '苹果'}
# 2. 计算所有购物清单的并集，保存到all中
all = s1 | s2 | s3
# 3. 计算三个清单的交集，找出需要买3个的商品，保存到count3中，并输出
count3 = s1 & s2 & s3
print('需要买3个的商品：', count3)
# 4. 计算两两清单的交集，分别保存到s12,s13,s23中，并求并集，保存到count2
s12 = s1 & s2
s13 = s1 & s3
s23 = s2 & s3
count2 = s12 | s13 | s23
# 5. count2减去count3，找出需要买2个的商品，保存到count2中，并输出
count2 -= count3
print('需要买2个的商品：', count2)
# 6. 求出需要买1个的商品，保存到count1中，并输出
count1 = all - count2 - count3
print('需要买1个的商品：', count1)
